app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $errors = [];

        // Eğer kullanıcı zaten giriş yapmışsa
        if ($session->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        // Form gönderildiğinde
        if ($this->request->getMethod() === 'post') {
            // Validation kuralları
            $validation = \Config\Services::validation();
            $validation->setRules([
                'username' => 'required|alpha_numeric|min_length[5]|max_length[20]',
                'password' => 'required|min_length[3]', // Şifre kuralı minimum 3 olarak güncellendi
            ]);

            // Doğrulama çalıştır
            if (!$validation->withRequest($this->request)->run()) {
                // Doğrulama hatalarını al
                $errors = $validation->getErrors();
            } else {
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');

                // Kullanıcı doğrulama
                $userModel = new UserModel();
                $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'yonetici'
 LIMIT 1