app/Controllers/War.php

    public function list()
    {
        $model = new WarModel();
        $wars = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `wars`
ORDER BY `created_at` DESC